# NewSpaceTag Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewSpaceTag Method
Document Class See Also
---
Creates a new SpaceTag.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceTag NewSpaceTag(
	Space space,
	UV point,
	View view
)
```

Visual Basic
---
```text
Public Function NewSpaceTag ( _
	space As Space, _
	point As UV, _
	view As View _
) As SpaceTag
```

Visual C++
---
```text
public:
SpaceTag^ NewSpaceTag(
	Space^ space,
	UV^ point,
	View^ view
)
```

# ### Parameters
space
    Type: Autodesk.Revit.DB.Mechanical..::..Space The Space which the tag refers.
point
    Type: Autodesk.Revit.DB..::..UV A 2D point that dictates the location on the level of the space.
view
    Type: Autodesk.Revit.DB..::..View The view where the tag will lie.
# ### Return Value
If successful a SpaceTag object will be returned, otherwise nullNothingnullptra null reference (Nothing in Visual Basic). Suitable exceptions will be fired if the parameters are invalid.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the space does not exist in the given document. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the view does not exist in the given document. |

# See Also
Document Class
Autodesk.Revit.Creation Namespace